Schegg/Methods/Availability.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:t="http://schemas.microsoft.com/exchange/services/2006/types">
    <soap:Body>
        <GetUserAvailabilityRequest xmlns="http://schemas.microsoft.com/exchange/services/2006/messages"
            xmlns:t="http://schemas.microsoft.com/exchange/services/2006/types">
            <t:TimeZone xmlns="http://schemas.microsoft.com/exchange/services/2006/types">
                <Bias>480</Bias>
                <StandardTime>
                    <Bias>0</Bias>
                    <Time>02:00:00</Time>
                    <DayOrder>5</DayOrder>
                    <Month>10</Month>
                    <DayOfWeek>Sunday</DayOfWeek>
                </StandardTime>
                <DaylightTime>
                    <Bias>-60</Bias>
                    <Time>02:00:00</Time>
                    <DayOrder>1</DayOrder>
                    <Month>4</Month>
                    <DayOfWeek>Sunday</DayOfWeek>
                </DaylightTime>
            </t:TimeZone>
            <MailboxDataArray>
                <t:MailboxData>
                    <t:Email>
                        <t:Address>{{room-address}}</t:Address>
                    </t:Email>
                    <t:AttendeeType>Room</t:AttendeeType>
                    <t:ExcludeConflicts>false</t:ExcludeConflicts>
                </t:MailboxData>
            </MailboxDataArray>
            <t:FreeBusyViewOptions>
                <t:TimeWindow>
                    <t:StartTime>{{start-time}}</t:StartTime>
                    <t:EndTime>{{end-time}}</t:EndTime>
                </t:TimeWindow>
                <t:MergedFreeBusyIntervalInMinutes>{{interval}}</t:MergedFreeBusyIntervalInMinutes>
                <t:RequestedView>MergedOnly</t:RequestedView>
            </t:FreeBusyViewOptions>
        </GetUserAvailabilityRequest>
    </soap:Body>
</soap:Envelope>